<?php
class Dinosaurs
{

    const PERIOD_NAME = [
        0 => "先カンブリア時代",
        1 => "カンブリア期",
        2 => "オルドビス紀",
        3 => "シルル紀",
        4 => "デボン紀",
        5 => "石炭紀",
        6 => "ペルム紀",
        7 => "三畳紀",
        8 => "ジュラ紀",
        9 => "白亜紀",
        10 => "パレオジン",
        11 => "ネオジン"
    ];


    const COUNTRY_NAME = [
        0 => "アメリカ合衆国",
        1 => "中国",
        2 => "ロシア",
    ];

    const REGION_NAME = [
        0 => "ブリテン諸島",
    ];

    const STATE_NAME = [
        0 => "ヨーロッパ",
        1 => "北アメリカ",
    ];

    const HABITAT = [
        0 => "海",
        1 => "森林",
    ];

    const FOOD = [
        0 => "植物",
        0 => "葉",
        0 => "種子",
    ];
}
